Repository: koteyye/tee-zee-nator
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Apply
ru: Применить

source: Cancel
ru: Отменить

source: Save
ru: Сохранить

source: Open Folder
ru: Открыть папку

source: Close Tab
ru: Закрыть вкладку

source: Publish to Confluence
ru: Опубликовать в Confluence

# musicateButton
source: Musicify
ru: Музицировать

source: Open in Folder
ru: Открыть в папке

source: File Explorer
ru: Проводник файлов

source: Tab Bar
ru: Панель вкладок

source: AI Chat
ru: AI Чат

source: Content Viewer
ru: Область просмотра

source: Toolbar
ru: Панель инструментов

source: Status Bar
ru: Строка состояния

# fileModified
source: Modified
ru: Изменен

# fileSaved
source: Saved
ru: Сохранен

# filePending
source: Pending Confirmation
ru: Ожидает подтверждения

# fileAccepted
source: Accepted
ru: Принято

# fileRejected
source: Rejected
ru: Отклонено

# aiChatModeNew
source: New Specification
ru: Новое ТЗ

# aiChatModeAmendments
source: Amendments
ru: Дополнения

# aiChatModeAnalysis
source: Analysis
ru: Анализ

# errorOpeningFile
source: Error opening file: {fileName}
ru: Ошибка открытия файла: {fileName}

# fileSavedSuccess
source: File saved successfully
ru: Файл успешно сохранен

source: Changes applied
ru: Изменения применены

source: Changes cancelled
ru: Изменения отменены

# confluenceIntegrationActive
source: Confluence: active
ru: Confluence: активно

# confluenceIntegrationInactive
source: Confluence: inactive
ru: Confluence: неактивно

# appVersion
source: Version {version}
ru: Версия {version}

# createdBy
source: Created by {author}
ru: Создано {author}

source: Confluence: active
ru: Confluence: активно

source: Confluence: inactive
ru: Confluence: неактивно

source: Music: active
ru: Музикация: активно

source: Music: inactive
ru: Музикация: неактивно

# musicActiveWithBalance
source: Music: active (balance: {balance}â‚½)
ru: Музикация: активно (баланс: {balance}₽)

source: Menu
ru: Меню

# errorOpeningProject
source: Error opening project: {error}
ru: Ошибка открытия проекта: {error}

source: Project refreshed
ru: Проект обновлен

# errorRefreshingProject
source: Error refreshing: {error}
ru: Ошибка обновления: {error}

source: Content applied successfully
ru: Контент успешно применен

# errorApplyingContent
source: Error applying: {error}
ru: Ошибка применения: {error}

source: Content rejected
ru: Контент отклонен

source: Generated content awaiting approval
ru: Сгенерированный контент ожидает одобрения

# openAIChat
source: Open AI Chat (Ctrl+Shift+A)
ru: Открыть AI Чат (Ctrl+Shift+A)

# projectOpened
source: Project "{projectName}" opened
ru: Проект "{projectName}" открыт

# errorSavingFile
source: Error saving: {error}
ru: Ошибка сохранения: {error}

# fileEmptyOrNotLoaded
source: File is empty or not loaded
ru: Файл пуст или не загружен

# maxOpenTabsReached
source: Maximum open tabs: {maxTabs}
ru: Максимум открытых вкладок: {maxTabs}

# unsavedChangesTitle
source: Unsaved Changes
ru: Несохраненные изменения

# unsavedChangesMessage
source: You have unsaved changes in {fileName}. Save before closing?
ru: У вас есть несохраненные изменения в {fileName}. Сохранить перед закрытием?

source: Don't Save
ru: Не сохранять

# errorRevertingChanges
source: Error reverting changes: {error}
ru: Ошибка отмены изменений: {error}

# quickSearchInDevelopment
source: Quick file search (in development)
ru: Быстрый поиск файлов (в разработке)

source: Find in file (in development)
ru: Поиск в файле (в разработке)

# errorDirectoryNotFound
source: Directory not found
ru: Директория не найдена

# errorDirectoryAccessDenied
source: No access to directory
ru: Нет доступа к директории

# errorTooManyFiles
source: Too many files in project (max {maxFiles})
ru: Слишком много файлов в проекте (максимум {maxFiles})

# errorNoSupportedFiles
source: No supported files found in directory
ru: В директории не найдено поддерживаемых файлов

# errorFileNotFound
source: File not found
ru: Файл не найден

# errorFileTooBig
source: File too big (max {maxSizeMb} MB)
ru: Файл слишком большой (максимум {maxSizeMb} MB)

# errorFileReadPermission
source: No read permission for file
ru: Нет прав для чтения файла

# errorAiInvalidResponse
source: Invalid AI response received
ru: Получен невалидный ответ от AI

# errorAiNetworkError
source: Network error when accessing AI
ru: Ошибка сети при обращении к AI

# errorAiTimeout
source: AI request timeout exceeded
ru: Превышено время ожидания ответа от AI

# errorGeneric
source: An error occurred: {message}
ru: Произошла ошибка: {message}

# retryAction
source: Retry
ru: Повторить

source: Settings
ru: Настройки

source: Templates
ru: Шаблоны

source: About
ru: О программе

# aboutDialogTitle
source: About TeeZeeNator
ru: О программе TeeZeeNator

# aboutDialogCreator
source: Created by: Koteyye
ru: Создатель: Koteyye

source: Close
ru: Закрыть
